TRUNCATE bookings, slots, schedules, rooms, users CASCADE;

INSERT INTO users (id, email, role) VALUES
                                        ('00000000-0000-0000-0000-000000000001', 'admin@example.com', 'admin'),
                                        ('00000000-0000-0000-0000-000000000002', 'user@example.com', 'user')
    ON CONFLICT (id) DO UPDATE SET email = EXCLUDED.email, role = EXCLUDED.role;

INSERT INTO rooms (id, name, description, capacity) VALUES
                                                        ('10000000-0000-0000-0000-000000000001', 'Актовый зал', 'Для конференций и массовых выступлений', 200),
                                                        ('10000000-0000-0000-0000-000000000002', 'Амфитеатр', 'Для презентаций', 40),
                                                        ('10000000-0000-0000-0000-000000000003', 'Conference Hall', 'Конференц-зал с спец оборудованием', 100);

INSERT INTO rooms (id, name, description, capacity) VALUES
                                                        ('20000000-0000-0000-0000-000000000001', 'Тихий коворкинг: Место №1', 'Тихое место для уединенной работы', 1),
                                                        ('20000000-0000-0000-0000-000000000002', 'Тихий коворкинг: Место №2', 'Тихое место для уединенной работы', 1);

INSERT INTO rooms (id, name, description, capacity) VALUES
                                                        ('30000000-0000-0000-0000-000000000001', 'Тысячелетний Сокол', 'Пространство с круглым столом для обсуждений', 6),
                                                        ('30000000-0000-0000-0000-000000000002', 'Тардис', 'Пространство с круглым столом для обсуждений', 10),
                                                        ('30000000-0000-0000-0000-000000000003', 'Энтерпрайз', 'Несколько небольших столов для командных обсуждений', 12);

INSERT INTO schedules (room_id, days_of_week, start_time, end_time) VALUES
                                                                        ('10000000-0000-0000-0000-000000000001', '{2,4}', '10:00', '18:00'),
                                                                        ('10000000-0000-0000-0000-000000000002', '{2,4}', '10:00', '18:00');

INSERT INTO schedules (room_id, days_of_week, start_time, end_time) VALUES
                                                                        ('20000000-0000-0000-0000-000000000001', '{0,1,2,3,4,5,6}', '00:00', '23:59'),
                                                                        ('20000000-0000-0000-0000-000000000002', '{0,1,2,3,4,5,6}', '00:00', '23:59');

INSERT INTO schedules (room_id, days_of_week, start_time, end_time) VALUES
                                                                        ('30000000-0000-0000-0000-000000000001', '{1,2,3,4,5}', '09:00', '20:00'),
                                                                        ('30000000-0000-0000-0000-000000000002', '{1,2,3,4,5}', '09:00', '20:00'),
                                                                        ('30000000-0000-0000-0000-000000000003', '{1,2,3,4,5}', '09:00', '20:00'),
                                                                        ('10000000-0000-0000-0000-000000000003', '{1,2,3,4,5}', '08:00', '21:00');

INSERT INTO slots (id, room_id, start_ts, end_ts) VALUES
    ('00000000-1111-0000-0000-000000000001', '30000000-0000-0000-0000-000000000002',
     CURRENT_DATE + INTERVAL '1 day' + INTERVAL '11 hours',
     CURRENT_DATE + INTERVAL '1 day' + INTERVAL '11 hours 30 minutes');

INSERT INTO bookings (slot_id, user_id, status, conference_link) VALUES
    ('00000000-1111-0000-0000-000000000001', '00000000-0000-0000-0000-000000000002', 'active', 'https://vcs.tardis.com/meeting-room');